reworked arch diagram in README.md
